In [3]:
import pandas as pd

df = pd.read_csv("/workspaces/Data_3500_notes/Lecture code/titanic.csv")

Programming Activity 1

Using the Titanic dataset and the Pandas library, fill in any missing data cells in the 'ages' column with the median age.

In [18]:
df["Age"].fillna(df["Age"].median(), inplace=True)
df.head(7)

/tmp/ipykernel_4335/4091785636.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(df["Age"].median(), inplace=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,28.0,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

Programming Activity 2

Using the Titanic dataset and the Pandas library, create a new column called 'FamilySize' and fill it with the size of the passenger's family.

In [4]:
df["Family Size"] = df["SibSp"] + df["Parch"]
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family Size
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

Programming Activity 3

Using the Titanic dataset and the Pandas library, find the average survival rate by class and sex.

In [5]:
survive_class_sex = df.groupby(["Pclass","Sex"])["Survived"].mean()

print("Average survival rate by class and sex:", survive_class_sex)

Average survival rate by class and sex: Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

Programming Activity 4

Using the Titanic dataset and the Pandas library, find the average fare per class.

In [6]:
average_fare_class = df.groupby(["Pclass"])["Fare"].mean()
print("Average fare by class:", average_fare_class)

Average fare by class: Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

Programming Activity 5

Using the Titanic dataset and the Pandas library, find the median age of survivors versus non-survivors.

In [7]:
median_age_survivors = df.groupby(["Survived"])["Age"].median()
print("Median age of survivors and non-survivors:", median_age_survivors)

Median age of survivors and non-survivors: Survived
0    28.0
1    28.0
Name: Age, dtype: float64

Programming Activity 6
Using the weather file (located on week 11 programming activities page), find the longest warm streak where the high temperature was above 65 degrees.

In [4]:
import pandas as pd

df = pd.read_csv("/workspaces/Data_3500_notes/Lecture code/SLC_weather.csv")

In [10]:
df["Hot"] = df["Max Temp"] > 65

current_streak = 0
longest_streak = 0

for is_hot in df["Hot"]:
    if is_hot:
        current_streak += 1
        if current_streak > longest_streak:
            longest_streak = current_streak
        else:
            current_streak = 0

print("Longest streak:", longest_streak, "days")

Longest streak: 11 days

Programming Activity 7

Using the same weather dataset, find the hottest day and the coldest night.

In [14]:


hottest_day = df.loc[df["Max Temp"].idxmax()]
coldest_night = df.loc[df["Min Temp"].idxmin()]

print("Coldest night:", coldest_night)
print("Hottest day:", hottest_day)

Coldest night: Date             10/28/2025
Max Temp                 51
Min Temp                 30
Avg Temp               40.5
Departure              -8.9
HDD                      24
CDD                       0
Precipitation             0
New Snow                  0
Snow Depth                0
Hot                   False
Volatility               21
Name: 27, dtype: object
Hottest day: Date             10/3/2025
Max Temp                85
Min Temp                57
Avg Temp              71.0
Departure             10.6
HDD                      0
CDD                      6
Precipitation         0.14
New Snow                 0
Snow Depth               0
Hot                   True
Volatility              28
Name: 2, dtype: object

Programming Activity 8
Using the same weather dataset, find the single most volatile day (the day with the biggest difference between high and low temperature).

In [15]:
df["Volatility"] = df["Max Temp"] - df["Min Temp"]

most_volatile = df.loc[df["Volatility"].idxmax()]

print("Most volatile day:", most_volatile)

Most volatile day: Date             10/11/2025
Max Temp                 77
Min Temp                 42
Avg Temp               59.5
Departure               2.8
HDD                       5
CDD                       0
Precipitation           0.6
New Snow                  0
Snow Depth                M
Hot                    True
Volatility               35
Name: 10, dtype: object